*************** Principio de datos ***********************************
/*  nombre: Juan Manuel Gomez Gaytan                                */
/*  fecha : 12/10/2021                                              */
/*  descripcion: ejercicio20                                        */
/********************************************************************/
  pgm                                                                 
                                                                      
         call pgm(XXXX22_2)                                           
                                                                      
  endpgm                                                              